Revit 2026 API

# ViewActivatingEventArgsCurrentActiveView Property

---

The view that is currently active.

**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public View CurrentActiveView { get; }
```
```vb
Public ReadOnly Property CurrentActiveView As View
	Get
```
```cpp
public:
property View^ CurrentActiveView {
	View^ get ();
}
```
```fsharp
member CurrentActiveView : View with get
```

#### Property Value

View

May be  if there is no currently active view.

#### Reference

ViewActivatingEventArgs Class

Autodesk.Revit.UI.Events Namespace